backend/controllers/DriverController.php

    public function actionFiles($id)
    {
        if (($model = Driver::findOne($id)) !== null) {
            if ($model->status == $model::BERKAS_DELETED) {
                throw new NotFoundHttpException('The requested page does not exist.');

            }
        }

        if ($model->load(Yii::$app->request->post())) {
              $files = UploadedFile::getInstance($model, 'files');

              if (!empty($files))
                  $model->files = $model->nama.'.'.$files->extension;

              if($model->save()){
---
SELECT * FROM `driver` WHERE `id`='16'
SELECT * FROM `driver` WHERE `id`='22'
UPDATE `driver` SET `files`='Lembar_pengesahan_Agung Prasetyo.pdf' WHERE `id`=17

    protected function findModel($id)
    {
        if (($model = Driver::findOne($id)) !== null) {
---
SELECT * FROM `driver` WHERE `id`='16'