backend/controllers/DriverController.php

                if ($flag) {
                    $transaction->commit();

                    $files->saveAs( Yii::getAlias('@public') . '/uploads/files/' . $model['Driver']->files);
---
UPDATE `driver` SET `berkas`='Diterima' WHERE `id`=15

    public function actionFiles($id)
    {
        if (($model = Driver::findOne($id)) !== null) {
---
SELECT * FROM `driver` WHERE `id`='15'