common/models/Driver.php

SELECT * FROM `driver` WHERE `id`=9
---
    public function isTerima($id)
    {
        $model = static::findOne($id);

SELECT * FROM `driver` WHERE `id`=9
---
    public function isTolak($id)
    {
        $model = static::findOne($id);

SELECT * FROM `driver` WHERE `id`=9
---
    public function hasFiles($id)
    {
        $model = static::findOne($id);